Repository: abdelrahmanwahdan11/-nov27
Catalog: assets/l10n/intl_*.arb
Languages: ar

# app_title
source: Neon Diet
ar: حمية النيون

# onboarding_title_1
source: Track your calories
ar: تتبع السعرات

# onboarding_title_2
source: Stay hydrated
ar: ابقَ رطباً

# onboarding_title_3
source: Own your progress
ar: سيطر على تقدمك

# onboarding_subtitle_1
source: Capture every sip and bite with neon clarity.
ar: سجّل كل رشفة ولقمة بوضوح نيون.

# onboarding_subtitle_2
source: Colorful juices make better days.
ar: العصائر الملوّنة تصنع أياماً أفضل.

# onboarding_subtitle_3
source: Charts, badges and streaks keep you motivated.
ar: الرسوم والشارات تحفّزك دائماً.

source: Get started
ar: لنبدأ

source: Skip
ar: تخطي

source: Login
ar: تسجيل الدخول

source: Sign up
ar: إنشاء حساب

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm password
ar: تأكيد كلمة المرور

source: Forgot password?
ar: هل نسيت كلمة المرور؟

# guest_login
source: Continue as guest
ar: الدخول كضيف

source: Home
ar: الرئيسية

source: Catalog
ar: الكتالوج

source: Progress
ar: التقدم

source: Profile
ar: الملف الشخصي

source: Calories this week
ar: سعرات هذا الأسبوع

source: Done
ar: تم

source: Add to diet
ar: أضف للخطة

# ai_info
source: AI insight
ar: معلومة ذكية

source: Search
ar: بحث

source: Filters
ar: فلاتر

source: Apply
ar: تطبيق

source: Reset
ar: إعادة

source: Compare
ar: مقارنة

# empty_comparison
source: Pick at least two meals to compare.
ar: اختر وجبتين على الأقل للمقارنة.

source: Back to catalog
ar: عودة للكتالوج

# send_link
source: Send reset link
ar: إرسال الرابط

# fake_reset
source: If this email exists, we will nudge it.
ar: إن وجد البريد سنرسل رابطاً وهمياً.

source: Log out
ar: تسجيل الخروج

source: Theme
ar: السمة

source: Language
ar: اللغة

source: Dark mode
ar: الوضع الليلي

source: Primary color
ar: اللون الرئيسي

source: Weekly goal
ar: هدف الأسبوع

source: Achievements
ar: الإنجازات

source: Streak
ar: سلسلة

source: Calorie chart
ar: رسم السعرات

source: Add to plan
ar: أضف للخطة

# comparison_limit
source: You can compare up to 3 items
ar: يمكن مقارنة ثلاثة عناصر فقط

source: Selected
ar: محدد

source: Remove
ar: إزالة

# password_rules
source: Use 8+ chars with numbers & symbols.
ar: ٨ أحرف مع أرقام ورموز.

source: Invalid email
ar: بريد غير صحيح

# short_password
source: Password too short
ar: كلمة المرور قصيرة

# mismatch_password
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# success_signup
source: Account stored locally
ar: تم حفظ الحساب محلياً

source: Guest
ar: ضيف

# ai_placeholder
source: Soon, AI tips will explain why this meal rocks.
ar: لاحقاً سيشرح الذكاء الاصطناعي سبب روعة هذه الوجبة.

source: Week
ar: أسبوع

source: Comparison
ar: مقارنة

source: Meal plan
ar: خطة الوجبات

# today_focus
source: Today's focus
ar: تركيز اليوم

source: Daily energy
ar: طاقة اليوم

source: Hydration
ar: الترطيب

source: Hydration goal
ar: هدف الترطيب

source: glasses
ar: أكواب

# start_plan
source: Start neon plan
ar: ابدأ خطة النيون

source: Coach notes
ar: ملاحظات المدرب

source: Journey
ar: الرحلة

# journey_button
source: Open journey timeline
ar: عرض خط الرحلة

# journey_subtitle
source: Milestones and reflections from your neon streak.
ar: معالم وانعكاسات من سلسلة النيون الخاصة بك.

source: Add reflection
ar: أضف ملاحظة

# notes_hint
source: Write how you feel today...
ar: اكتب شعورك اليوم...

source: Mindful break
ar: استراحة وعي

# breathing_prompt
source: Take 3 deep breaths before the next snack.
ar: خذ ثلاث أنفاس عميقة قبل الوجبة التالية.

# hydrate_now
source: Add a glass
ar: أضف كوباً

# plan_ready
source: Plan refreshed for today
ar: تم تحديث الخطة لليوم

# reflection_saved
source: Reflection saved locally
ar: تم حفظ الملاحظة محلياً

source: Breakfast
ar: فطور

source: Lunch
ar: غداء

source: Dinner
ar: عشاء

source: Snacks
ar: وجبات خفيفة

source: Wellness hub
ar: مركز العافية

# wellness_intro
source: Balance neon hustle with mindful pauses, hydration, and gratitude.
ar: وازن نشاطك النيون مع لحظات وعي وترطيب وامتنان.

# wellness_preview
source: Micro check-ins keep your glow steady.
ar: فحوصات صغيرة تحفظ توهجك.

# start_check_in
source: Log a check-in
ar: سجّل فحصاً سريعاً

source: Mindful stories
ar: قصص تأملية

# refresh_stories
source: Shuffle cards
ar: تحديث البطاقات

# story_hint
source: Swipe through neon mantras and pause on the one that speaks to you today.
ar: اسحب بين العبارات النيونية وتوقف عند التي تلهمك اليوم.

source: Recent reflections
ar: تأملات حديثة

# no_reflections
source: Nothing logged yet — your first note will shine here.
ar: لم يتم تسجيل أي ملاحظة بعد.

# log_hydration
source: Hydration boost
ar: جرعة ترطيب

# log_hydration_250
source: +250 ml
ar: +٢٥٠ مل

# log_hydration_500
source: +500 ml
ar: +٥٠٠ مل

# hydration_reset
source: Reset
ar: إعادة تعيين

source: Current mood
ar: المزاج الحالي

# mood_low
source: Low
ar: منخفض

# mood_chill
source: Chill
ar: هادئ

# mood_balanced
source: Balanced
ar: متزن

# mood_focused
source: Focused
ar: مركّز

# mood_euphoric
source: Euphoric
ar: متحمس

# wellness_settings_hint
source: Open mindful cards, hydration and reflections.
ar: افتح بطاقات الوعي والترطيب والملاحظات.

source: Daily check-in
ar: فحص يومي

source: Energy
ar: الطاقة

source: Mood
ar: المزاج

source: Reflection
ar: ملاحظة

# reflection_placeholder
source: Type a neon promise or gratitude...
ar: اكتب وعداً أو امتناناً بنغمة نيون...

source: Save check-in
ar: حفظ الفحص

# check_in_saved
source: Check-in logged locally
ar: تم حفظ الفحص محلياً

source: Community challenges
ar: تحديات المجتمع

# challenges_intro
source: Micro missions designed to keep the neon streak alive.
ar: مهام صغيرة تبقي وهج النيون مستمراً.

source: Join challenge
ar: انضم للتحدي

# challenge_joined
source: Joined
ar: منضم

# challenge_progress
source: Progress
ar: التقدم

# challenge_day_done
source: Log day
ar: سجّل اليوم

source: Coach chat
ar: محادثة المدرب

# coach_intro
source: Chat with the offline neon mentor whenever you need focus.
ar: تحدث مع المدرب النيون بدون اتصال عندما تحتاج للتركيز.

# type_message
source: Type a message...
ar: اكتب رسالة...

source: Recipe lab
ar: مختبر الوصفات

# recipe_intro
source: Blend futuristic juices, tweak sparkle, and star your favorites.
ar: امزج عصائر مستقبلية واضبط البريق وضع المفضلة.

# recipe_preview_cta
source: Open lab
ar: افتح المختبر

source: Flavor intensity
ar: حدة النكهة

# favorite_recipes_cta
source: Highlight favorites
ar: تمييز المفضلات

# favorites_updated
source: Favorite list updated
ar: تم تحديث المفضلات

# community_cta
source: Join a challenge
ar: انضم لتحدي

# recipe_cta
source: Blend a neon recipe
ar: امزج وصفة نيون

# coach_cta
source: Chat with coach
ar: تحدث مع المدرب

# insights_cta
source: Open insights
ar: افتح التحليلات

# grocery_cta
source: Plan groceries
ar: خطط للمشتريات

# habit_cta
source: Tune habits
ar: اضبط العادات

source: Habit studio
ar: استوديو العادات

# habit_intro
source: Design micro rituals, balance hydration and mindful moves.
ar: صمم طقوساً صغيرة ووازن الترطيب والحركة الواعية.

# habit_focus
source: Focus
ar: التركيز

# habit_streak
source: Streak
ar: السلسلة

# habit_boost
source: Boost streak
ar: تعزيز السلسلة

# habit_settings_hint
source: Reorder and tune rituals for every day.
ar: أعد ترتيب الطقوس واضبطها لكل يوم.

source: Grocery planner
ar: مخطط المشتريات

# grocery_intro
source: Organize neon ingredients and mark them as you shop.
ar: نظم المكونات وعلّم ما تم شراؤه.

# grocery_empty
source: No groceries yet — tap + to add essentials.
ar: لا توجد مشتريات بعد — اضغط + لإضافة الأساسيات.

# grocery_add_hint
source: Spinach leaves, chia, coconut...
ar: سبانخ، شيا، جوز هند...

# grocery_added
source: Item added to list
ar: تمت إضافة العنصر

source: Add item
ar: إضافة عنصر

source: Item name
ar: اسم العنصر

source: Category
ar: الفئة

source: Quantity
ar: الكمية

source: Insights
ar: التحليلات

# insights_intro
source: Macro balance, hydration rhythm, and calm minutes at a glance.
ar: توازن المغذيات وإيقاع الترطيب ولحظات الهدوء في نظرة واحدة.

source: Refresh insights
ar: تحديث التحليلات

# insight_highlights
source: Highlights
ar: أبرز النقاط

# insights_button
source: Open advanced insights
ar: افتح التحليلات المتقدمة

source: Recovery suite
ar: جناح الاسترخاء

# recovery_intro
source: Flood your routine with calming loops, naps, and mini walks.
ar: اغمر روتينك بدورات مهدئة، قيلولات، ومشي قصير.

# recovery_breath_title
source: Guided breath
ar: تنفس موجه

# recovery_breath_subtitle
source: Match the neon orb and inhale confidence, exhale noise.
ar: طابق الكرة المتوهجة واستنشق الثقة وازفر الضجيج.

# recovery_sessions
source: Sessions
ar: جلسات

# recovery_shuffle_toast
source: Sessions remixed
ar: تم إعادة خلط الجلسات

# recovery_add_session
source: Add recovery
ar: أضف استرخاء

# recovery_added
source: Fresh recovery added
ar: تمت إضافة جلسة جديدة

# recovery_complete
source: Session reset
ar: تمت إعادة ضبط الجلسة

# recovery_completed_toast
source: Session marked as complete
ar: تم تعليم الجلسة كمكتملة

# recovery_energy
source: Energy
ar: الطاقة

# recovery_duration
source: Duration
ar: المدة

# recovery_cta
source: Open recovery
ar: افتح الاسترخاء

source: Ritual builder
ar: منشئ الطقوس

# ritual_intro
source: Design layered rituals that anchor hydration, movement, and focus.
ar: صمّم طقوساً متدرجة تثبّت الترطيب والحركة والتركيز.

# ritual_steps
source: Steps
ar: الخطوات

# ritual_add_step
source: Add custom cue
ar: أضف تلميحاً مخصصاً

# ritual_placeholder
source: Example: Breath before coffee
ar: مثال: تنفس قبل القهوة

# ritual_focus_label
source: Focus intensity
ar: حدة التركيز

# ritual_custom_added
source: Cue added
ar: تمت إضافة التلميح

# ritual_cta
source: Tune rituals
ar: اضبط الطقوس

source: Rewards vault
ar: خزانة المكافآت

# rewards_intro
source: Collect offline badges and points as you glow through habits.
ar: اجمع الشارات والنقاط بلا اتصال أثناء توهج العادات.

# rewards_points
source: Points
ar: النقاط

# rewards_unlock_hint
source: Unlocked
ar: تم الفتح

# rewards_unlocked_toast
source: Badge unlocked
ar: تم فتح الشارة

# rewards_cta
source: View rewards
ar: اعرض المكافآت

source: Energy studio
ar: استوديو الطاقة

# energy_studio_cta
source: Energy studio
ar: استوديو الطاقة

source: Energy charge
ar: شحنة الطاقة

# energy_wave_hint
source: Ride breathing waves to refill neon focus.
ar: اركب موجات التنفس لإعادة شحن التركيز المتوهج.

source: Boost energy
ar: تعزيز الطاقة

# energy_patterns
source: Pulse patterns
ar: أنماط النبض

# energy_shuffle
source: Remix waves
ar: إعادة خلط الموجات

source: Energy trend
ar: منحنى الطاقة

source: Sleep sanctuary
ar: ملاذ النوم

# sleep_sanctuary_cta
source: Sleep sanctuary
ar: ملاذ النوم

# sleep_preview
source: Wind down with cues, breathing, and journaling.
ar: اهدأ مع التلميحات، التنفس، والمذكرات.

# sleep_cues
source: Wind-down cues
ar: مؤشرات التهيئة

# sleep_progress
source: Wind-down progress
ar: تقدم التهيئة للنوم

# sleep_cta
source: Open sleep sanctuary
ar: افتح ملاذ النوم

# sleep_cue_toast
source: Cue toggled
ar: تم تحديث المؤشر

# winddown_hint
source: Complete cues to reach dream state.
ar: أكمل المؤشرات للوصول إلى وضع الحلم.

source: Momentum journal
ar: دفتر الزخم

# momentum_intro
source: Capture glowing wins, reflections, and notes.
ar: سجّل اللحظات اللامعة والتأملات اليومية.

# momentum_add
source: Add reflection
ar: أضف ملاحظة

# momentum_placeholder
source: I felt lighter after...
ar: شعرت بخفة بعد...

# momentum_saved
source: Reflection captured
ar: تم حفظ الملاحظة

# momentum_shuffle
source: Shuffle highlights
ar: إعادة ترتيب الومضات

# momentum_empty
source: No reflections yet
ar: لا توجد ملاحظات بعد

# momentum_cta
source: Open momentum journal
ar: افتح دفتر الزخم

source: Flow lab
ar: مختبر التدفق

# flow_lab_subtitle
source: Remix breath-tempo circuits, micro strength, and hydration cues.
ar: أعد خلط تمارين التنفس والتمارين المصغرة وتلميحات الترطيب.

# flow_sequence
source: Sequence
ar: التسلسل

# flow_tempo
source: Tempo
ar: الإيقاع

# flow_loops
source: Loops
ar: الجولات

# flow_intensity
source: Intensity
ar: الشدة

# flow_play
source: Launch flow
ar: ابدأ التدفق

# flow_shuffle_toast
source: Flow remixed
ar: تم تحديث التدفق

# flow_cta
source: Open flow lab
ar: افتح مختبر التدفق

# flow_preview
source: Featured flow
ar: تدفق مميز

source: Focus gym
ar: صالة التركيز

# focus_intro
source: Train attention with micro drills and breath holds.
ar: درّب الانتباه بتمارين دقيقة وحبس النفس.

# focus_cta
source: Open focus gym
ar: افتح صالة التركيز

# focus_complete
source: Complete drill
ar: أكمل التمرين

# focus_reset
source: Reset drills
ar: إعادة التمارين

source: Focus progress
ar: تقدم التركيز

# journey_reflections
source: Reflections studio
ar: استوديو الومضات

# journey_reflections_subtitle
source: Capture sparks, colors, and mindful notes.
ar: سجّل الومضات والألوان والملاحظات الواعية.

# journey_log
source: Log spark
ar: سجل ومضة

# journey_placeholder
source: Describe the moment that felt electric...
ar: صف اللحظة التي شعرت فيها بالطاقة...

# journey_saved
source: Spark saved
ar: تم حفظ الومضة

# journey_empty
source: No sparks logged yet
ar: لا توجد ومضات بعد

# journey_cta
source: Explore sparks
ar: استكشف الومضات

# journey_manual_title
source: Manual spark
ar: ومضة يدوية

# journey_preview
source: Latest spark
ar: آخر ومضة

# journey_reflections_cta
source: Open reflections studio
ar: افتح استوديو الومضات

# spark_slider
source: Mood color
ar: لون المزاج
